{******************************************}
{                                          }
{             FastReport v4.0              }
{          Language resource file          }
{                                          }
{         Copyright (c) 1998-2006          }
{         by Alexander Tzyganenko,         }
{            Fast Reports Inc.             }
{                                          }
{******************************************}

unit frxrcExports;

interface

implementation

uses frxRes;

const resStr =
'======== TfrxXLSExportDialog ========' + #13#10 +
'8000=Экспорт в Excel' + #13#10 +
'8001=Стили' + #13#10 +
'8002=Картинки' + #13#10 +
'8003=Объединять ячейки' + #13#10 +
'8004=Быстрый экспорт' + #13#10 +
'8005=WYSIWYG' + #13#10 +
'8006=Как текст' + #13#10 +
'8007=Фон' + #13#10 +
'8008=Открыть Excel после экспорта' + #13#10 +
'8009=Файл Excel (*.xls)|*.xls' + #13#10 +
'8010=.xls' + #13#10 +
'' + #13#10 +
'======== TfrxXMLExportDialog ========' + #13#10 +
'8100=Экспорт в Excel' + #13#10 +
'8101=Стили' + #13#10 +
'8102=WYSIWYG' + #13#10 +
'8103=Фон' + #13#10 +
'8104=Открыть Excel после экспорта' + #13#10 +
'8105=Файл Excel (*.xls)|*.xls' + #13#10 +
'8106=.xls' + #13#10 +
'' + #13#10 +
'======== TfrxHTMLExportDialog ========' + #13#10 +
'8200=Экспорт в HTML (табличный)' + #13#10 +
'8201=Открыть после экспорта' + #13#10 +
'8202=Стили' + #13#10 +
'8203=Картинки' + #13#10 +
'8204=Все в одной папке' + #13#10 +
'8205=Фикс.ширина' + #13#10 +
'8206=Навигатор' + #13#10 +
'8207=Многостраничный' + #13#10 +
'8208=Браузер Mozilla' + #13#10 +
'8209=Фон' + #13#10 +
'8210=Файл HTML (*.html)|*.html' + #13#10 +
'8211=.html' + #13#10 +
'' + #13#10 +
'======== TfrxTXTExportDialog ========' + #13#10 +
'8300=Экспорт в текст' + #13#10 +
'8301=Просмотр результата' + #13#10 +
'8302= Опции' + #13#10 +
'8303=Разрывы страниц' + #13#10 +
'8304=OEM-кодировка' + #13#10 +
'8305=Пустые строки' + #13#10 +
'8306=Пробелы слева' + #13#10 +
'8307=Номера' + #13#10 +
'8308=Введите номера и/или диапазоны страниц, разделенные запятыми. Например, 1,3,5-12' + #13#10 +
'8309= Масштаб' + #13#10 +
'8310=по оси X' + #13#10 +
'8311=по оси Y' + #13#10 +
'8312= Рамки' + #13#10 +
'8313=Нет' + #13#10 +
'8314=Текстовые' + #13#10 +
'8315=Графические' + #13#10 +
'8316=Only with OEM codepage' + #13#10 +
'8317=Печать после экспорта' + #13#10 +
'8318=Сохранить настройки' + #13#10 +
'8319= Просмотр' + #13#10 +
'8320=Ширина:' + #13#10 +
'8321=Высота:' + #13#10 +
'8322=Страница' + #13#10 +
'8323=Увеличить' + #13#10 +
'8324=Уменьшить' + #13#10 +
'8325=Текстовый файл (*.txt)|*.txt' + #13#10 +
'8326=.txt' + #13#10 +
'' + #13#10 +
'======== TfrxPrnInit ========' + #13#10 +
'8400=Печать' + #13#10 +
'8401=Принтер' + #13#10 +
'8402=Имя' + #13#10 +
'8403=Настройки...' + #13#10 +
'8404=Копии' + #13#10 +
'8405=Количество' + #13#10 +
'8406= Опции' + #13#10 +
'8407=Тип принтера' + #13#10 +
'8408=.fpi' + #13#10 +
'8409=Настройки принтера (*.fpi)|*.fpi' + #13#10 +
'8410=.fpi' + #13#10 +
'8411=Настройки принтера (*.fpi)|*.fpi' + #13#10 +
'' + #13#10 +
'======== TfrxRTFExportDialog ========' + #13#10 +
'8500=Экспорт в RTF (табличный)' + #13#10 +
'8501=Картинки' + #13#10 +
'8502=WYSIWYG' + #13#10 +
'8503=Открыть после экспорта' + #13#10 +
'8504=Файл RTF (*.rtf)|*.rtf' + #13#10 +
'8505=.rtf' + #13#10 +
'' + #13#10 +
'======== TfrxIMGExportDialog ========' + #13#10 +
'8600=Экспорт в рисунок' + #13#10 +
'8601= Опции' + #13#10 +
'8602=Качество JPEG' + #13#10 +
'8603=Разрешение (dpi)' + #13#10 +
'8604=Раздельные файлы' + #13#10 +
'8605=Обрезать страницу' + #13#10 +
'8606=Монохромный' + #13#10 +
'' + #13#10 +
'======== TfrxPDFExportDialog ========' + #13#10 +
'8700=Экспорт в PDF' + #13#10 +
'8701=Компрессия' + #13#10 +
'8702=Встроить шрифты' + #13#10 +
'8703=Высокое разрешение' + #13#10 +
'8704=Оглавление' + #13#10 +
'8705=Фон' + #13#10 +
'8706=Открыть после экспорта' + #13#10 +
'8707=Файл Adobe PDF (*.pdf)|*.pdf' + #13#10 +
'8708=.pdf' + #13#10 +
'' + #13#10 +
'RTFexport=Документ Word (табличный)' + #13#10 +
'BMPexport=Рисунок BMP' + #13#10 +
'JPEGexport=Рисунок JPEG' + #13#10 +
'TIFFexport=Рисунок TIFF' + #13#10 +
'TextExport=Текстовый файл (prn)' + #13#10 +
'XlsOLEexport=Документ Excel (OLE)' + #13#10 +
'HTMLexport=Документ HTML (табличный)' + #13#10 +
'XlsXMLexport=Документ Excel (XML)' + #13#10 +
'PDFexport=Документ PDF' + #13#10 +
'ProgressWait=Подождите, пожалуйста' + #13#10 +
'ProgressRows=Настройка строк' + #13#10 +
'ProgressColumns=Настройка колонок' + #13#10 +
'ProgressStyles=Настройка стилей' + #13#10 +
'ProgressObjects=Экспорт объектов' + #13#10 +
'TIFFexportFilter=Рисунок TIFF (*.tif)|*.tif' + #13#10 +
'BMPexportFilter=Рисунок BMP (*.bmp)|*.bmp' + #13#10 +
'JPEGexportFilter=Рисунок JPEG (*.jpg)|*.jpg' + #13#10 +
'HTMLNavFirst=Начало' + #13#10 +
'HTMLNavPrev=Пред.' + #13#10 +
'HTMLNavNext=След.' + #13#10 +
'HTMLNavLast=Конец' + #13#10 +
'HTMLNavRefresh=Обновить' + #13#10 +
'HTMLNavPrint=Печать' + #13#10 +
'HTMLNavTotal=Всего страниц' + #13#10 +
'======== TfrxSimpleTextExportDialog ========' + #13#10 +
'8800=Экспорт в текст' + #13#10 +
'8801=Текстовый файл (*.txt)|*.txt' + #13#10 +
'8802=.txt' + #13#10 +
'SimpleTextExport=Текстовый файл' + #13#10 +
'======== TfrxCSVExportDialog ========' + #13#10 +
'8850=Экспорт в CSV' + #13#10 +
'8851=CSV файл (*.csv)|*.csv' + #13#10 +
'8852=.csv' + #13#10 +
'8853=Разделитель' + #13#10 +
'CSVExport=CSV файл' + #13#10 +
'======== TfrxMailExportDialog ========' + #13#10 +
'8900=Отослать по E-mail' + #13#10 +
'8901=E-mail' + #13#10 +
'8902=Ящик' + #13#10 +
'8903=Подключение' + #13#10 +
'8904=Адрес' + #13#10 +
'8905=Приложение' + #13#10 +
'8906=Формат' + #13#10 +
'8907=Адрес' + #13#10 +
'8908=Автор' + #13#10 +
'8909=Сервер' + #13#10 +
'8910=Имя' + #13#10 +
'8911=Письмо' + #13#10 +
'8912=Сообщение' + #13#10 +
'8913=Текст' + #13#10 +
'8914=Организация' + #13#10 +
'8915=Пароль' + #13#10 +
'8916=Порт' + #13#10 +
'8917=Запомнить настройки' + #13#10 +
'8918=Необходимые поля не заполнены' + #13#10 +
'8919=Расширенные настройки экспорта' + #13#10 +
'8920=Подпись' + #13#10 +
'8921=Собрать' + #13#10 +
'8922=Тема' + #13#10 +
'8923=С уважением' + #13#10 +
'8924=Отправка письма на' + #13#10 +
'EmailExport=E-mail' + #13#10 +
'FastReportFile=FastReport файл' + #13#10 +
'======== TfrxGIFExport ========' + #13#10 +
'GifexportFilter=Рисунок Gif (*.gif)|*.gif' + #13#10 +
'GIFexport=Рисунок Gif' + #13#10 +
'======== 3.21 ========' + #13#10 +
'8950=Неразрывный' + #13#10 +
'======== 3.22 ========' + #13#10 +
'8951=Колонтитулы' + #13#10 +
'8952=Текст' + #13#10 +
'8953=Колонтитулы' + #13#10 +
'8954=Нет' + #13#10 +
'ODSExportFilter=Open Document Таблица (*.ods)|*.ods' + #13#10 +
'ODSExport=Open Document Таблица' + #13#10 +
'ODTExportFilter=Open Document Текст (*.odt)|*.odt' + #13#10 +
'ODTExport=Open Document Текст' + #13#10 +
'8960=.ods' + #13#10 +
'8961=.odt' + #13#10 +
'';

initialization
  frxResources.AddStrings(resStr);

end.
